import type { ForeignSample } from './types';

export const km: ForeignSample[] = [
  {
    // https://en.wikipedia.org/wiki/Nokor_Reach
    label: 'បទនគររាជ — សរសើរជាតិកម្ពុជា',
    text: 'សូមពួកទេព្តា រក្សាមហាក្សត្រយើង ឱ្យបានរុងរឿង ដោយជ័យមង្គលសិរីសួស្តី យើងខ្ញុំព្រះអង្គ សូមជ្រកក្រោមម្លប់ព្រះបារមី នៃព្រះនរបតីវង្ស ក្សត្រាដែលសាងប្រាសាទថ្ម គ្រប់គ្រងដែនខ្មែរ បុរាណថ្កើងថ្កាន។',
  },
  {
    // https://www.yosothor.org/publications/khmer-renaissance/chapter-three/Rama_Dupant_Sita.html
    label: 'រាមកេរ្តិ៍ — រាមដុបឥន្ទសីតា',
    text: 'កាលនោះក្សត្រីនិម៌ល ភ្ញាភ្ញាក់ទតយល់ក្សត្រា ក្រេវក្រោធពិរោធសោះសា ស្ទុះរត់ចរចេញទៅខ្មី ហើយនាងទូលតបទៅថ្វាត់ បពិត្រមហាក្សត្រនរបតី ស្ដេចធ្វើច្នេះពុំជូក្ដី យល់ល្អហើយឬក្សត្រថ្លៃ',
  },
  {
    // https://www.ohchr.org/sites/default/files/UDHR/Documents/UDHR_Translations/khm.pdf
    label: 'សេចក្តីប្រកាសជាសកលស្តីពីសិទ្ធិមនុស្ស — មាត្រា ១',
    text: 'មនុស្សទាំងអស់កើតមកមានសេរីភាពនិងសមភាពក្នុងថ្នែកសេចក្ដីថ្លៃថ្នូរនិងសិទ្ធិ។ មនុស្សមានវិចារណញ្ញាណ និងសតិសម្បជញ្ញៈជាប់ពីកំណើត ហើយគប្បីប្រព្រឹត្តចំពោះគ្នាទៅវិញទៅមកក្នុងស្មារតីភាតរភាពជាបងប្អូន។',
  },
];
