import type { ForeignSample } from './types';

export const or: ForeignSample[] = [
  {
    // https://odialive.com/vande-utkala-janani-lyrics/
    label: 'ଲକ୍ଷ୍ମୀକାନ୍ତ ମହାପାତ୍ର — ବନ୍ଦେ ଉତ୍କଳ ଜନନୀ',
    text: 'ବନ୍ଦେ ଉତ୍କଳ ଜନନୀ, ଚାରୁ ହାସମୟୀ ଚାରୁ ଭାଷମୟୀ, ଜନନୀ, ଜନନୀ, ଜନନୀ। ଘନ ଘନ ବନଭୂମି ରାଜିତ ଅଙ୍ଗେ, ନୀଳ ଭୂଧରମାଳା ସାଜେ ତରଙ୍ଗେ, କଳ କଳ ମୁଖରିତ ଚାରୁ ବିହଙ୍ଗେ, ଜନନୀ, ଜନନୀ, ଜନନୀ।',
  },
  {
    // https://www.omniglot.com/udhr/indoiranian.htm
    label: 'ସାର୍ବଜନୀନ ମାନବ ଅଧିକାର ଘୋଷଣା — ମାତ୍ରା ୧',
    text: 'ସବୁ ମନୁଷ୍ୟ ଜନ୍ମକାଳରୁ ସ୍ୱାଧୀନ. ସେମାନଙ୍କର ମର୍ଯ୍ୟାଦା ଓ ଅଧିକାର ସମାନ. ସେମାନଙ୍କଠାରେ ପ୍ରଜ୍ଞା ଓ ବିବେକ ନିହିତ ଅଛି. ସେମାନେ ପରସ୍ପର ପ୍ରତି ଭାତୃଭାବ ପୋଷଣ କରି କାର୍ଯ୍ୟ କରିବା ଦରକାର.',
  },
  {
    // https://x.com/Naveen_Odisha/status/1449612763714646021
    label: 'ରାଧାନାଥ ରାୟ — ଚିଲିକା',
    text: 'ଉତ୍କଳ-କମଳା-ବିଳାସ-ଦୀର୍ଘିକା, ମରାଳମାଳିନୀ ନୀଳାମ୍ବୁ ଚିଲିକା, ଉତ୍କଳର ତୁହି ଚାରୁ ଅଳଙ୍କାର ଉତ୍କଳଭୁବନେ ଶୋଭାର ଭଣ୍ଡାର',
  },
  {
    // http://pathasala.odiaportal.in/2018/05/Mishu-Mora-Deha-E-Desha-Matire-By-Gopabandhu-Das-Full-Poem.html
    label: 'ଗୋପବନ୍ଧୁ ଦାସ — ବନ୍ଦୀର ଆତ୍ମକଥା',
    text: 'ଦେଶବାସୀ ବନ୍ଧୁ ଆତ୍ମୀୟ ସୋଦର, କାରାଦଣ୍ଡେ ମୋର ହେଲ କି କାତର? ଥିଲା ଏହା ଆଗୁଁ ଜଣାଶୁଣା କଥା, ସେଥିପାଇଁ ତେବେ କିମ୍ପା ମନେ ବ୍ୟଥା। ମିଶୁ ମୋର ଦେହ ଏ ଦେଶମାଟିରେ, ଦେଶବାସୀ ଚାଲିଯାଆନ୍ତୁ ପିଠିରେ।',
  },
  {
    // https://www.bhubaneswarbuzz.com/stories-by-people/bhima-bhoi-wanted-know-great-poet-odisha
    label: 'ଭୀମ ଭୋଇ — ସ୍ତୁତିଚିନ୍ତାମଣି',
    text: 'ପ୍ରାଣୀମାନଙ୍କ ଆରତ ଦୁଃଖ ଅପ୍ରମିତ ଦେଖି ଦେଖି କେବା ସହୁ, ମୋ ଜୀବନ ପଛେ ନର୍କେ ପଡ଼ିଥାଉ ଜଗତ ଉଦ୍ଧାର ହେଉ।',
  },
  {
    // https://thesmaranika.blogspot.com/2020/01/tu-para-bolau-utkala-santan-lyrics-odia.html
    label: 'ମଧୁସୂଦନ ଦାସ — ଉତ୍କଳ ସନ୍ତାନ',
    text: 'ତୁ ପରା ବୋଲାଉ ଉତ୍କଳ ସନ୍ତାନ ତେବେ କିମ୍ପା ତୁହି ଭୀରୁ ତୋହର ଜନନୀ ରୋଦନ କରିଲେ କହିବାକୁ କିମ୍ପା ଡରୁ? ତୋ ପୂର୍ବପୁରୁଷ ଜୟ କରିଥିଲେ ଗଙ୍ଗା ଠାରୁ ଗୋଦାବରୀ ତାଙ୍କର ଔରସୁ ଜନ୍ମହୋଇ ତୁହି କେଉଁ ଗୁଣେ ତାଙ୍କୁ ସରି?',
  },
];
